In [2]:
import numpy as np
import pandas as pd

pandas `Series` 알아보기

In [17]:
obj = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])

In [4]:
obj

a    4
b    7
c   -5
d    3
dtype: int64

리스트의 성분 개수 = index 갯수

In [5]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.dtypes

dtype('int64')

In [8]:
sdata = {"조재성": 163, "김석영": 167, "조재경": 162}

In [11]:
obj3 = pd.Series(sdata)

In [20]:
obj3

조재성    163
김석영    167
조재경    162
dtype: int64

즉, pd.Series() 인자에는 List, np.array()/ 파이썬 딕셔너리가 들어가 수 있다.

In [21]:
obj3.name = "조재성패밀리"
obj3.index.name = '이름'

In [22]:
obj3

이름
조재성    163
김석영    167
조재경    162
Name: 조재성패밀리, dtype: int64

또다른 특징은 Series의 이름과 index의 이름을 지정할 수 있다.
series변수.name = "시리즈 이름", series변수.index.name = "인덱스 이름 "

In [23]:
obj3.index = ['마누라', '남편', '동생']

In [24]:
obj3

마누라    163
남편     167
동생     162
Name: 조재성패밀리, dtype: int64

비슷하게, 위에서 입력한 index의 값을 바꿔 줄 수도 있다.   
Series변수.index = [새로운 인덱스]

#### pandas `DataFrame` 살펴보기

먼저ㅡ 딕셔너리 형태로 데이터를 정의하는데, {키값: value}에서 value자리에 `[리스트 형태로 입력]`한다  
그렇게 하면 **키값**들의 __개수__는 __열의 갯수__가 될 것이고,  
__리스트의 성분들의 갯수__는 각 __행의 갯수__를 담당

In [31]:
data = {'name': ['Kilho', 'Kilho', 'Kilho', 'Charles', 'Charles'],
       'year': [2014, 2015, 2016, 2015, 2016],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)

In [21]:
df

      name  year  points
0    Kilho  2014     1.5
1    Kilho  2015     1.7
2    Kilho  2016     3.6
3  Charles  2015     2.4
4  Charles  2016     2.9

In [23]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [25]:
df.values

array([['Kilho', 2014, 1.5],
       ['Kilho', 2015, 1.7],
       ['Kilho', 2016, 3.6],
       ['Charles', 2015, 2.4],
       ['Charles', 2016, 2.9]], dtype=object)

Series와 마찬가지로 DataFrame의 index와 columns에도 이름을 붙힐 수 있다.

In [27]:
df.index.name = 'Num'
df.columns.name = 'info'

In [28]:
df

info     name  year  points
Num
0       Kilho  2014     1.5
1       Kilho  2015     1.7
2       Kilho  2016     3.6
3     Charles  2015     2.4
4     Charles  2016     2.9

하지만, 딕셔너리에서 정의한 키값을 인자로 columns에 직접 넣어 columns의 순서를 새롭게 정의할 수 있으며, 만약 키값이 미리 존재하지 않는 이름은 columns인자의 성분으로 넣는다면 그 칼럼은 **NaN**으로 표시과 된다  
또한, 인자로서, index를 입력하면, 리스트 성분의 개수로 자동설정되어 0부터 시작하던 **index**의 이름을 줄 수 있다

In [35]:
df2 = pd.DataFrame(data, columns=["year", 'points', 'name', 'penalty_new'], 
                   index=['one', 'two', 'three', 'four', 'five'])

In [36]:
df2

       year  points     name penalty_new
one    2014     1.5    Kilho         NaN
two    2015     1.7    Kilho         NaN
three  2016     3.6    Kilho         NaN
four   2015     2.4  Charles         NaN
five   2016     2.9  Charles         NaN

NaN은 Not a Number를 의미

#### 또 다른 유용함수 df.describe()라는 함수가 있다.  
연산이 가능한 숫자를 가진 컬럼을 뽑아내고   
그 칼럽들에 대해 `기본 통계량(총 개수, 평균, 표준편차, 최소값, 퍼센트, 최대값)`을 산출하여 표시

In [37]:
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000